In [27]:
import pandas as pd
import numpy as np

In [28]:
df= pd.DataFrame(pd.read_csv('train.csv'))
df.head()

   PassengerId  Survived  Pclass  ... Lifeboat Body  Class
0            1       0.0       3  ...      NaN  NaN    3.0
1            2       1.0       1  ...        4  NaN    1.0
2            3       1.0       3  ...      14?  NaN    3.0
3            4       1.0       1  ...        D  NaN    1.0
4            5       0.0       3  ...      NaN  NaN    3.0

[5 rows x 21 columns]

In [29]:
data=df.drop(['WikiId','Name_wiki','Age_wiki','Hometown','Boarded','Destination','Lifeboat','Body','Class'],axis=1)

In [30]:
data.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1       0.0       3  ...   7.2500   NaN         S
1            2       1.0       1  ...  71.2833   C85         C
2            3       1.0       3  ...   7.9250   NaN         S
3            4       1.0       1  ...  53.1000  C123         S
4            5       0.0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [31]:
data.shape

(891, 12)

In [33]:
data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [34]:
drop_col=data.isnull().sum()[data.isnull().sum()>(35/100*data.shape[0])]
drop_col

Cabin    687
dtype: int64

In [35]:
drop_col.index

Index(['Cabin'], dtype='object')

In [36]:
data.drop(drop_col.index, axis=1, inplace=True)
data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked         2
dtype: int64

In [37]:
data.fillna(data.mean(), inplace=True)
data.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       2
dtype: int64

In [38]:
data['Embarked'].describe()

count     889
unique      3
top         S
freq      644
Name: Embarked, dtype: object

In [39]:
data['Embarked'].fillna('S', inplace=True)
data.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

In [40]:
data.corr()

             PassengerId  Survived    Pclass  ...     SibSp     Parch      Fare
PassengerId     1.000000 -0.005007 -0.035144  ... -0.057527 -0.001652  0.012658
Survived       -0.005007  1.000000 -0.338481  ... -0.035322  0.081629  0.257307
Pclass         -0.035144 -0.338481  1.000000  ...  0.083081  0.018443 -0.549500
Age             0.033207 -0.069809 -0.331339  ... -0.232625 -0.179191  0.091566
SibSp          -0.057527 -0.035322  0.083081  ...  1.000000  0.414838  0.159651
Parch          -0.001652  0.081629  0.018443  ...  0.414838  1.000000  0.216225
Fare            0.012658  0.257307 -0.549500  ...  0.159651  0.216225  1.000000

[7 rows x 7 columns]

In [41]:
data['FamilySize']=data['SibSp']=data['Parch']
data.drop(['SibSp','Parch'], axis=1, inplace=True)
data.corr()

             PassengerId  Survived    Pclass       Age      Fare  FamilySize
PassengerId     1.000000 -0.005007 -0.035144  0.033207  0.012658   -0.001652
Survived       -0.005007  1.000000 -0.338481 -0.069809  0.257307    0.081629
Pclass         -0.035144 -0.338481  1.000000 -0.331339 -0.549500    0.018443
Age             0.033207 -0.069809 -0.331339  1.000000  0.091566   -0.179191
Fare            0.012658  0.257307 -0.549500  0.091566  1.000000    0.216225
FamilySize     -0.001652  0.081629  0.018443 -0.179191  0.216225    1.000000

In [42]:
data['Alone']=[0 if data['FamilySize'][i]>0 else 1 for i in data.index]
data.head()

   PassengerId  Survived  Pclass  ... Embarked FamilySize  Alone
0            1       0.0       3  ...        S          0      1
1            2       1.0       1  ...        C          0      1
2            3       1.0       3  ...        S          0      1
3            4       1.0       1  ...        S          0      1
4            5       0.0       3  ...        S          0      1

[5 rows x 11 columns]

In [43]:
data.groupby(['Alone'])['Survived'].mean()

Alone
0    0.511737
1    0.343658
Name: Survived, dtype: float64

In [44]:
data[['Alone','Fare']].corr()

          Alone      Fare
Alone  1.000000 -0.237717
Fare  -0.237717  1.000000

In [46]:
data['Sex']=[0 if data['Sex'][i]=='male'else 1 for i in data.index]
data.groupby(['Sex'])['Survived'].mean()

Sex
0    0.188908
1    0.742038
Name: Survived, dtype: float64

In [47]:
data.groupby(['Embarked'])['Survived'].mean()

Embarked
C    0.553571
Q    0.389610
S    0.339009
Name: Survived, dtype: float64